
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/mongulu-cm/mtchoun-mouh/actions/runs/11113700647)



<pre><code>Apply complete! Resources: 1 added, 2 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Running apply in the remote backend. Output will stream here. Pressing Ctrl-C
will cancel the remote apply if it's still pending. If the apply started it
will stop streaming the logs, but will not stop the apply running remotely.

Preparing the remote apply...

To view this run in a browser, visit:
https://app.terraform.io/app/tfc-mongulu-cm/mtchoun-mouh-snyk-fix-werkzeug/runs/run-V2K3trQE7t9m64Qz

Waiting for the plan to start...

Terraform v1.9.6
on linux_amd64
Initializing plugins and modules...
data.archive_file.lambda_zip: Reading...
data.archive_file.lambda_zip: Read complete after 0s [id=a302387976ce74579a87a903dcc6149f70895053]
data.aws_iam_role.role: Reading...
aws_cloudwatch_event_rule.scheduler: Refreshing state... [id=mtchoun-mouh-snyk-fix-werkzeug-trigger_user_scan]
aws_dynamodb_table.Link_table: Refreshing state... [id=mtchoun-mouh-snyk-fix-werkzeug-Link_table]
aws_api_gateway_rest_api.api: Refreshing state... [id=qyz3uxbg3f]
aws_s3_bucket.images: Refreshing state... [id=mtchoun-mouh-snyk-fix-werkzeug-djansang]
data.aws_caller_identity.current: Reading...
aws_lambda_layer_version.test_lambda_layer: Refreshing state... [id=arn:aws:lambda:eu-central-1:053932140667:layer:test_lambda_layer:9]
aws_s3_bucket.website: Refreshing state... [id=mtchoun-mouh-snyk-fix-werkzeug-mtchoun-mouh.mongulu.cm]
aws_dynamodb_table.Users: Refreshing state... [id=mtchoun-mouh-snyk-fix-werkzeug-Users]
aws_dynamodb_table.Register: Refreshing state... [id=mtchoun-mouh-snyk-fix-werkzeug-Register]
data.aws_caller_identity.current: Read complete after 0s [id=053932140667]
data.aws_iam_role.role: Read complete after 0s [id=website-deployer]
aws_lambda_function.scan: Refreshing state... [id=mtchoun-mouh-snyk-fix-werkzeug-scan_user_consulcam]
aws_lambda_function.lambda: Refreshing state... [id=mtchoun-mouh-snyk-fix-werkzeug-user_registration_consulcam]
aws_api_gateway_resource.resource: Refreshing state... [id=m808a2]
aws_api_gateway_method.method: Refreshing state... [id=agm-qyz3uxbg3f-m808a2-POST]
module.cors.aws_api_gateway_method._: Refreshing state... [id=agm-qyz3uxbg3f-m808a2-OPTIONS]
aws_lambda_permission.allow_cloudwatch_to_call_check_foo: Refreshing state... [id=AllowExecutionFromCloudWatch]
aws_cloudwatch_event_target.target: Refreshing state... [id=mtchoun-mouh-snyk-fix-werkzeug-trigger_user_scan-lambda]
module.cors.aws_api_gateway_method_response._: Refreshing state... [id=agmr-qyz3uxbg3f-m808a2-OPTIONS-200]
module.cors.aws_api_gateway_integration._: Refreshing state... [id=agi-qyz3uxbg3f-m808a2-OPTIONS]
aws_api_gateway_method_response.method_response_200: Refreshing state... [id=agmr-qyz3uxbg3f-m808a2-POST-200]
aws_lambda_permission.apigw_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
aws_api_gateway_integration.integration: Refreshing state... [id=agi-qyz3uxbg3f-m808a2-POST]
module.cors.aws_api_gateway_integration_response._: Refreshing state... [id=agir-qyz3uxbg3f-m808a2-OPTIONS-200]
aws_api_gateway_deployment.test: Refreshing state... [id=3ljwzn]
local_file.index_page: Refreshing state... [id=504f2bacdec0b4fcb16af56cd7185e92f24a1c5e]
aws_s3_bucket_public_access_block.website: Refreshing state... [id=mtchoun-mouh-snyk-fix-werkzeug-mtchoun-mouh.mongulu.cm]
aws_s3_bucket_object.example_file: Refreshing state... [id=index.html]
aws_s3_bucket_policy.website: Refreshing state... [id=mtchoun-mouh-snyk-fix-werkzeug-mtchoun-mouh.mongulu.cm]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_s3_bucket.images will be updated in-place
  ~ resource "aws_s3_bucket" "images" {
        id                          = "mtchoun-mouh-snyk-fix-werkzeug-djansang"
        tags                        = {
            "Name"        = "images"
            "environment" = "mtchoun-mouh-master"
            "project"     = "mtchoun-mouh"
        }
        # (11 unchanged attributes hidden)

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm     = "AES256" -> null
                    # (1 unchanged attribute hidden)
                }
            }
        }

        # (1 unchanged block hidden)
    }

  # aws_s3_bucket.website will be updated in-place
  ~ resource "aws_s3_bucket" "website" {
        id                          = "mtchoun-mouh-snyk-fix-werkzeug-mtchoun-mouh.mongulu.cm"
        tags                        = {
            "Name"        = "Website"
            "environment" = "mtchoun-mouh-master"
            "project"     = "mtchoun-mouh"
        }
        # (13 unchanged attributes hidden)

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm     = "AES256" -> null
                    # (1 unchanged attribute hidden)
                }
            }
        }

        # (3 unchanged blocks hidden)
    }

  # local_file.index_page will be created
  + resource "local_file" "index_page" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "../html/index.html"
      + id                   = (known after apply)
    }

Plan: 1 to add, 2 to change, 0 to destroy.


------------------------------------------------------------------------

Cost estimation:

Resources: 3 of 5 estimated
           $1.6848/mo +$0.0

------------------------------------------------------------------------

aws_s3_bucket.images: Modifying... [id=mtchoun-mouh-snyk-fix-werkzeug-djansang]
aws_s3_bucket.website: Modifying... [id=mtchoun-mouh-snyk-fix-werkzeug-mtchoun-mouh.mongulu.cm]
local_file.index_page: Creating...
local_file.index_page: Creation complete after 0s [id=504f2bacdec0b4fcb16af56cd7185e92f24a1c5e]
aws_s3_bucket.images: Modifications complete after 5s [id=mtchoun-mouh-snyk-fix-werkzeug-djansang]
aws_s3_bucket.website: Modifications complete after 5s [id=mtchoun-mouh-snyk-fix-werkzeug-mtchoun-mouh.mongulu.cm]

Apply complete! Resources: 1 added, 2 changed, 0 destroyed.

Outputs:

register_table = "mtchoun-mouh-snyk-fix-werkzeug-Register"
stage_url = "https://qyz3uxbg3f.execute-api.eu-central-1.amazonaws.com/mtchoun-mouh-snyk-fix-werkzeug-dev"
website_url = "http://mtchoun-mouh-snyk-fix-werkzeug-mtchoun-mouh.mongulu.cm.s3-website.eu-central-1.amazonaws.com"

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"deploy","PRNumber":198,"Program":"tfcmt","SHA1":"3c171c4b5bb28ef5739e400fb165538011c6827b","Vars":{},"WorkflowName":"Deploy cases"} -->